Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །འཕགས་པ་འདུས་པ་ཆེན་པོའི་སྡེ་ཉི་མའི་སྙིང་པོའི་མདོ་ལེའུ་བཅུ་གཅིག་པ་ལས་ཀླུ་སྐྱབས་སུ་འགྲོ་བའི་ལེའུ་སྟེ་བཅུ་གཅིག་པའོ།། །།འཕགས་པ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ་བམ་པོ་བཅུ་གསུམ་པ་སྟེ་ཐ་མ།
en: This concludes the chapter called “The Going for Refuge of the Nāgas,” the eleventh among the eleven chapters included in “The Quintessence of the Sun”—the noble discourse of The Great Assembly. Conclusion

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གནས་བརྟན་ཀུན་ཤེས་ཀཽ་ཌི་ནྱས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the elder Ājñātakauṇḍinya said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ལག་འགྲོ་དག་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། བསམ་གྱིས་མི་ཁྱབ་པའི་ལས་བསྟན་པའི་སྤྱོད་པ་དང་འབྲེལ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡུན་རིང་པོར་འབར་བར་མཛད་དུ་གསོལ།
en: “Blessed One, please bless the nāgas! Please make this Dharma teaching, which involves the conduct of teaching about the inconceivable karmic action, blaze for a long time!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཇི་སྲིད་དུ་གླིང་བཞི་པ་འདིར་མཆོད་རྟེན་ཆེན་པོ་འདི་དག་རྣལ་འབྱོར་ཡིད་ལ་བྱེད་པ་ལ་མངོན་པར་བརྩོན་པ་ཐམས་ཅད་ཀྱིས་སྟོངས་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་གླིང་བཞི་པ་འདིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རབ་ཏུ་སྤྱོད་པར་འགྱུར་རོ།
en: The Blessed One said, “As long as the great stūpas in this four-continent world still contain beings who diligently engage in practice, this Dharma teaching will continue to be practiced on the four continents.

source: །མཆོད་རྟེན་ཆེན་པོ་གང་དག་ཅེ་ན།
en: What are those great stūpas?

source: འཛམ་བུའི་གླིང་འདི་ན་མཆོད་རྟེན་དྲང་སྲོང་ཐུབ་པའི་གནས་ཀུན་རྟེན་འདི་ནི་སྔོན་ཆད་སྔོན་གྱི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་རྒྱལ་བ་དང་། ཉན་ཐོས་མང་པོ་གནས་གནས་ཤིང་མ་འོངས་པའི་དུས་ན་ཡང་གནས་པར་འགྱུར་བ་སྟེ།
en: Here in Jambudvīpa, many past buddhas, bodhisattvas, solitary buddhas, and hearers have continuously resided at this stūpa—the sacred site of wise sages called Complete Support—and they will continue to reside here in the future.

source: རྗེས་སུ་བསྟན་པ་ཆེན་པོ་ཡུན་རིང་དུ་གནས་པར་མཛད་པའི་ཕྱིར་དྲང་སྲོང་ཐུབ་པའི་གནས་ཀུན་རྟེན་འདི་ནི་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཆུ་ལྷའི་ལག་ཏུ་ཡོངས་སུ་གཏད་པ་མཛད་དོ།
en: The perfect buddhas of the past have entrusted this sacred site of wise sages called Complete Support to Varuṇa, to ensure that the great teachings remain for a long time.

source: །ངས་ཀྱང་དེ་ཉིད་ཀྱི་ལག་ཏུ་ཡོངས་སུ་གཏད་དེ།
en: I also entrust it to him.

source: འདི་ཡང་སྤྲོ་བར་འགྱུར་ཞིང་གང་ཟག་ཆོས་ཀྱིས་གནས་པ་རྣལ་འབྱོར་ཡིད་ལ་བྱེད་པ་ལ་མངོན་པར་བརྩོན་པ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: He will joyfully ripen those persons who abide by the Dharma and diligently engage in practice.

source: །གང་དག་གང་ཟག་ཆོས་ཀྱིས་གནས་པ་རྣམས་ལ་བསྙེན་བཀུར་ལ་མངོན་པར་བརྩོན་པའི་སྦྱིན་པ་པོ་དང་། སྦྱིན་བདག་དེ་དག་ཀྱང་ཡོངས་སུ་སྲུང་བར་འགྱུར་རོ།
en: He will also protect those donors and benefactors who strive to serve those who abide by the Dharma.”

source: །ཀླུའི་རྒྱལ་པོ་ཆུ་ལྷས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་ཏེ།
en: The nāga king Varuṇa replied, “Respected Blessed One, that is correct!

source: དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་གིས་དྲང་སྲོང་ཐུབ་པའི་གནས་ཀུན་རྟེན་འདི་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་ལགས་སོ།
en: The thus-gone Krakucchanda entrusted to me the protection of this sacred site of wise sages called Complete Support.

source: །གང་དག་གང་ཟག་མཉམ་པ་ཉིད་ལ་མངོན་པར་བརྩོན་པ་ཆོས་ཀྱིས་གནས་པ་རྣམས་ཀྱང་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་ལགས་སོ། །གང་དག་གང་ཟག་མཉམ་པ་ཉིད་ལ་མངོན་པར་བརྩོན་པ་ཆོས་ཀྱིས་གནས་པ་རྣམས་ལ་རིམ་གྲོ་ལ་མངོན་པར་བརྩོན་པའི་སྦྱིན་པ་པོ་དང་སྦྱིན་བདག་དེ་དག་ཀྱང་དེ་བཞིན་ལགས་ཏེ།
en: He has also entrusted to me the protection of those who exert themselves in sameness and abide by the Dharma, as well as the donors and benefactors who strive to serve those who exert themselves in sameness and abide by the Dharma.

source: ཇི་སྲིད་དུ་དམ་པའི་ཆོས་འབར་བར་འགྱུར་བ་དེ་ཁོ་ན་བཞིན་དུ་བདག་གིས་གཉི་ག་བསྲུངས་ལགས་སོ།
en: I will protect both those groups as requested, for as long as the sacred Dharma blazes.

source: །དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་ཀྱི་བར་དང་། དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་གི་བར་གྱིས་ཀྱང་དེའི་ཆོས་ཀྱི་ཚུལ་འབར་བར་བགྱི་བའི་སླད་དུ་གཏད་ལགས་སོ།
en: Similarly, the thus-gone ones Kanakamuni and Kāśyapa entrusted that task to me, to ensure that that Dharma way continues to blaze.

source: །དེ་བཞིན་དུ་ད་ལྟར་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་བཀས་དྲང་སྲོང་ཐུབ་པའི་གནས་ཀུན་རྟེན་ནས་གང་ཟག་མཉམ་པ་ཉིད་ལ་མངོན་པར་བརྩོན་པ་ཆོས་ཀྱིས་གནས་པ་རྣམས་ཀྱི་བར་དང་། གང་དག་མཉམ་པ་ཉིད་ལ་མངོན་པར་བརྩོན་པ་ཆོས་ཀྱིས་གནས་པ་རྣམས་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་ལ་མངོན་པར་བརྩོན་པའི་སྦྱིན་པ་པོ་དང་། སྦྱིན་བདག་དེ་དག་གི་བར་དག་དང་། ཇི་སྲིད་དུ་ཉན་ཐོས་དེ་དག་ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པར་གནས་པར་དེ་དག་ཐམས་ཅད་བསྲུང་བར་བགྱི་ལགས་སོ།
en: In the same way, following the command of the Blessed One, I will now protect the persons in this sacred site of wise sages called Complete Support who exert themselves in sameness and abide by the Dharma, as well as the donors and benefactors who strive to serve and revere those persons who exert themselves in sameness and abide by the Dharma. As long as those hearers reside here without assistance, I will protect them all!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་འགྲོའི་བདག་པོ་ལེགས་སོ་ལེགས་སོ།
en: “Excellent, nāga, excellent!” said the Blessed One.

source: །དེ་ལྟར་བྱིན་གྱིས་བརླབས་པས་ངའི་ཆོས་ཀྱི་ཚུལ་སྦྱིན་བདག་ཆེན་པོ་དེ་ལྟ་བུ་དག་གིས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ།
en: “Through these blessings, those great benefactors will make my Dharma way blaze for a long time!”

source: །བ་ལང་སྤྱོད་ཀྱི་གླིང་གི་ངོས་ན་རྡུལ་གྱི་རི་དེ་ལ་དྲང་སྲོང་ཐུབ་པའི་གནས་བཀྲ་བ་ནི་ཀླུའི་རྒྱལ་པོ་རིན་པོ་ཆེའི་ཕྲེང་བ་ཅན་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One then said, “In Godānīya, on Dust Mountain, there is the sacred site of wise sages called Bright Colors. [. . .] I entrust its protection to the nāga king Endowed with Jewel Garlands.”

source: །ཀླུའི་རྒྱལ་པོ་རིན་པོ་ཆེའི་ཕྲེང་བ་ཅན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་ཏེ།
en: “Respected Blessed One, that is correct!” replied the nāga king Endowed with Jewel Garlands.

source: དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་གིས་དེར་དྲང་སྲོང་ཐུབ་པའི་གནས་བཀྲ་བ་དེ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་ལགས་སོ་ཞེས་བྱ་བ་ནས། ཇི་སྲིད་དུ་ཉན་ཐོས་དེ་དག་ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པར་གནས་པ་དེ་སྲིད་དུ་བདག་གིས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱང་བར་བགྱི་ལགས་སོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “The thus-gone Krakucchanda entrusted to me the protection of this sacred site of wise sages called Bright Colors. [. . .] As long as those hearers reside there without assistance, I will look after them all!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྦྱིན་བདག་རྣམས་ཀྱིས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ། །ཤར་གྱི་ལུས་འཕགས་ཀྱི་ངོས་ན་ནི་ལང་ག་ཎའི་རི་ལ་དྲང་སྲོང་ཐུབ་པའི་གནས་དྲང་སྲོང་འབྱུང་བ་ནི་ཀླུའི་རྒྱལ་པོ་ཟླ་སྲུང་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་དེ་སྲིད་དུ་བདག་གིས་ཡོངས་སུ་བསྐྱང་བར་བགྱི་ལགས་སོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “Excellent, nāga, excellent!” said the Blessed One. “Through these blessings, those benefactors will make my Dharma way blaze for a long time!” The Blessed One then said, “In Pūrvavideha, on Langana Mountain, there is the sacred site of wise sages called Emergence of Sages. I entrust its protection to the nāga king Moon Protector.” The nāga king Moon Protector replied, “[. . .] For that long, I will look after them!”

source: །བྱང་གི་སྒྲ་མི་སྙན་གྱི་ངོས་ན་རྒྱལ་དགའི་རི་ལ་དྲང་སྲོང་ཐུབ་པའི་གནས་སྤོས་བརྩེགས་ནི་ཀླུའི་རྒྱལ་པོ་ལུས་འབིགས་པའི་ཁབ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དེ། གང་ཟག་མཉམ་པ་ཉིད་ལ་མངོན་པར་བརྩོན་པ་ཆོས་ཀྱིས་གནས་པ་རྣམས་ཀྱང་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ། །དེ་བཞིན་དུ་གང་ཟག་དགེ་སློང་མཉམ་པ་ཉིད་ལ་མངོན་པར་བརྩོན་པ་ཆོས་ཀྱིས་གནས་པ་རྣམས་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་ལ་མངོན་པར་བརྩོན་པའི་སྦྱིན་པ་པོ་དང་། སྦྱིན་བདག་དེ་དག་ཀྱང་ཆང་ཁྱིར་ངས་ཡོངས་སུ་གཏད་དོ།
en: The Blessed One then said, “In Uttarakuru, on Victorious Joy Mountain, there is the sacred site of wise sages called Stacked Incense. I entrust its protection to the nāga king Body-Piercing Needle. I also entrust to him the protection of those persons who exert themselves in sameness and abide by the Dharma, as well as the donors and benefactors who strive to serve and revere those monks who exert themselves in sameness and abide by the Dharma.”

source: །ཀླུའི་རྒྱལ་པོ་ལུས་འབིགས་པའི་ཁབ་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་ཏེ།
en: The nāga king Body-Piercing Needle replied, “Respected Blessed One, that is correct!

source: སྔོན་དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་གིས་དྲང་སྲོང་ཐུབ་པའི་གནས་སྤོས་བརྩེགས་དེ་ཡང་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་ལགས་སོ། །ཆོས་ཀྱིས་གནས་པ་ཡང་དེ་བཞིན་ལགས་སོ། །གསེར་ཐུབ་ཀྱིས་ཀྱང་དེ་བཞིན་ལགས་སོ་ཞེས་བྱ་བ་ནས་འོད་སྲུང་གིས་ཀྱང་དེ་བཞིན་ལགས་སོ་ཞེས་བྱ་བའི་བར་དང་། བདག་གིས་ཆོས་ཀྱི་ཚུལ་ཡང་དག་པར་བཟུང་ལགས་སོ་ཞེས་བྱ་བའི་བར་དང་།
en: In the past, the thus-gone Krakucchanda also entrusted to me the protection of this sacred site of wise sages called Stacked Incense as well as those who abide by the Dharma. Kanakamuni and Kāśyapa have done the same, and I have supported the Dharma way.

source: དེ་བཞིན་དུ་ད་ལྟར་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་བཀས་བདག་གིས་དྲང་སྲོང་ཐུབ་པའི་གནས་སྤོས་བརྩེགས་ཐམས་ཅད་བསྲུང་བར་བགྱི་ལགས་སོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: In the same way, following the command of the Blessed One, I will now protect that entire sacred site of wise sages called Stacked Incense!”

source: །དེ་ལྟར་བྱིན་གྱིས་བརླབས་པས་ཆོས་ཀྱི་ཚུལ་སྦྱིན་བདག་ཆེན་པོ་དེ་ལྟ་བུ་དག་གིས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ།
en: “Through these blessings, those great benefactors will make the Dharma way blaze for a long time!”

source: །དེ་བཞིན་དུ་བ་ལང་སྤྱོད་ཀྱི་གླིང་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་འོད་ཟེར་བྱུང་བ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་ཀླུའི་རྒྱལ་པོ་བ་ལང་མགོ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One then said, “In Godānīya, there is also the sacred site of wise sages called Source of Light Rays. I entrust its protection to the nāga king Gajaśīrṣa. [. . .] He will make the Dharma way blaze for a long time!”

source: །དེ་བཞིན་དུ་ཤར་གྱི་ལུས་འཕགས་གླིང་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་པད་མའི་ཤིང་ནྱ་གྲོ་དྷ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཀླུའི་རྒྱལ་པོ་དབྱིག་གཏོང་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One then said, “In Pūrvavideha, there is also the sacred site of wise sages called Lotus Flowers Like Banyan Trees. I entrust its protection to the nāga king Wealth Giver. [. . .] He will make the Dharma way blaze for a long time!”

source: །དེ་བཞིན་དུ་བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་སྤོས་བརྩེགས་འོད་ཟེར་ཅེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་ཀླུའི་རྒྱལ་པོ་གནས་ན་རྒྱུ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One then said, “In Uttarakuru, there is also the sacred site of wise sages called Light Rays of Stacked Incense. I entrust its protection to the nāga king Moving in Places. [. . .] He will make the Dharma way blaze for a long time!”

source: །དེ་བཞིན་དུ་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་གནས་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་ནོར་བུའི་སྙིང་པོའི་འོད་འཕྲོ་བ་གང་ཡིན་པ་དེ་ནི་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One then said, “Within the great ocean, in the dwelling place of the nāga king Sāgara, there is also the sacred site of wise sages called Radiating Diamond Light. I entrust its protection to the nāga king Sāgara. [. . .] He will make the Dharma way blaze for a long time!”

source: །དེ་བཞིན་དུ་རི་རབ་ཀྱི་རྩེ་མོ་ན་སུམ་ཅུ་རྩ་གསུམ་པའི་གནས་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་མེ་ཏོག་རབ་ཏུ་རྒྱས་པའི་སྙིང་པོ་གང་ཡིན་པ་དེ་ནི་ཀླུའི་རྒྱལ་པོ་ས་སྲུང་གི་བུ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One then said, “On the summit of Mount Sumeru, in the Heaven of the Thirty-Three, there is also the sacred site of wise sages called Essence of Blooming Flowers. I entrust its protection to the nāga king Airāvaṇa. [. . .] He will make the Dharma way blaze for a long time!”

source: །དེ་བཞིན་དུ་འཛམ་བུའི་གླིང་འདི་ན་དགའ་འཕེལ་ཞེས་བྱ་བ་ནས་དྲང་སྲོང་ཐུབ་པའི་གནས་གནས་བརྟན་གྱི་ཕུག་གང་ཡིན་པ་དེ་ནི་ཀླུའི་རྒྱལ་པོ་ཅེ་སྤྱང་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One then said, “Here in Jambudvīpa, at the place called Nandivardhana, there is also the sacred site of wise sages called Cave of the Elders. I entrust its protection to the nāga king Jackal. [. . .] He will make the Dharma way blaze for a long time!”

source: །དེ་བཞིན་དུ་ཡངས་པ་ཅན་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་ཤིན་ཏུ་བརྟན་པ་ནི་ཀླུའི་རྒྱལ་པོ་ནོར་རྒྱས་ཀྱི་བུ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: The Blessed One then said, “In Vaiśālī, there is also the sacred site of wise sages called Completely Stable. I entrust its protection to the nāga king Vāsuki. [. . .] He will make the Dharma way blaze for a long time!”

source: །དེ་བཞིན་དུ་སེར་སྐྱའི་གནས་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་གསེར་སྒྲོན་དྲི་ཞིམ་ནི་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “In Kapilavastu, there is also the sacred site of wise sages called Fragrance of the Golden Lamp. I entrust its protection to the nāga king Anavatapta. [. . .] He will make the Dharma way blaze for a long time!

source: །དེ་བཞིན་དུ་ཡུལ་མ་ག་དྷཱ་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་རྒྱ་ཆེན་ཞེས་བྱ་བ་ནི་ཀླུའི་རྒྱལ་པོ་རི་བོས་བྱིན་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “In Magadha, there is also the sacred site of wise sages called Vast. I entrust its protection to the nāga king Given by the Mountain. [. . .] He will make the Dharma way blaze for a long time!

source: །དེ་བཞིན་དུ་བཅོམ་བརླག་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་སྟུག་པའི་སྤྲིན་ནི་ཀླུའི་རྒྱལ་པོ་ཅེ་སྤྱང་དང་རྒྱུ་བ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “In Mathurā, there is also the sacred site of wise sages called Thick Clouds. I entrust its protection to both nāga kings Jackal and Movement. [. . .] They will make the Dharma way blaze for a long time!

source: །དེ་བཞིན་དུ་ཡུལ་འཁོར་ཀོ་ས་ལ་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་རྒྱལ་བ་དག་པ་ཞེས་བྱ་བ་ནི་ཀླུའི་རྒྱལ་པོ་སྲིན་བུ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “In the country of Kosala, there is also the sacred site of wise sages called Pure Victor. I entrust its protection to the nāga king Kṛmi. [. . .] He will make the Dharma way blaze for a long time!

source: །དེ་བཞིན་དུ་ཕུག་གི་ཕ་རོལ་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་བཏང་བཟུང་བདེན་པའི་དྲི་ཞེས་བྱ་བ་ནི་ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “Beyond Guhā, there is also the sacred site of wise sages called True Fragrance of Mucilinda. I entrust its protection to the nāga king Mucilinda. [. . .] He will make the Dharma way blaze for a long time!

source: །དེ་བཞིན་དུ་ཡུལ་འཁོར་ས་འཛིན་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་མཐོང་བའི་ལམ་རྒྱགས་ཞེས་བྱ་བ་ནི་ཀླུའི་རྒྱལ་པོ་ཨེ་ལའི་འདབ་མ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “In Gandhāra, there is also the sacred site of wise sages called Provisions for the Path of Seeing. I entrust its protection to the nāga king Elapatra. [. . .] He will make the Dharma way blaze for a long time!

source: །དེ་བཞིན་དུ་ཁ་ཆེའི་ཡུལ་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་གུར་ཀུམ་གྱི་རྩེ་མོ་ཞེས་བྱ་བ་ནི་ཀླུའི་རྒྱལ་པོ་ཧུ་ལུ་རུ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “In Kashmir, there is also the sacred site of wise sages called Saffron Summit. I entrust its protection to the nāga king Hullura. [. . .] He will make the Dharma way blaze for a long time!

source: །དེ་བཞིན་དུ་ཡུལ་ཆུ་ལེན་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་འོད་ཟེར་བྱེད་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ནི་ཀླུའི་རྒྱལ་པོ་འཕྱང་བ་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “In the land called Fetching Water, there is also the sacred site of wise sages called Essence of Illumination. I entrust its protection to the nāga king Dangler. [. . .] He will make the Dharma way blaze for a long time!

source: །དེ་བཞིན་དུ་རྒྱ་ཡུལ་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་སྲེད་མེད་ཀྱི་བུའི་འོད་ཅེས་བྱ་བ་ནི་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་བྱིན་གྱི་ལག་ཏུ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “In China, there is also the sacred site of wise sages called Light of Nārāyaṇa. I entrust its protection to the nāga king Samudradatta. [. . .] He will make the Dharma way blaze for a long time!

source: །དེ་བཞིན་དུ་ཁ་ཤའི་ཡུལ་ན་སའི་ནུ་མའི་གནས་རི་གླང་རུའི་དྲུང་ཆུ་བོ་གོ་མ་ཏིའི་ངོགས་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་གོ་མ་སཱ་ལ་གན་དྷ་ཞེས་བྱ་བ་མཆོད་རྟེན་ཆེན་པོའི་གནས་ནི་ཀླུའི་རྒྱལ་པོ་ཁྱིམ་བདག་གིས་བྱིན་གྱི་ལག་ཏུ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ་ཞེས་བྱ་བ་ནས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “In the land of Khaṣa, at the place called Breast of the Earth near Mount Gośṛṇga, along the bank of the Gomatī river, there is also the sacred site of wise sages called Gomasālagandha. I entrust the protection of that sacred place to the nāga king Given by a Householder. [. . .] He will make the Dharma way blaze for a long time!

source: །མཆོད་རྟེན་ཆེན་པོ་དེ་དག་ནི་སྔོན་ཆད་དྲང་སྲོང་ཐུབ་པའི་ཁྱུ་མཆོག་མང་པོ་གནས་ཤིང་སྔོན་ཆད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མང་པོ་ཡང་གནས་གནས། སྔོན་ཆད་རང་རྒྱལ་བ་མང་པོ་ཡང་གནས་གནས། སྔོན་ཆད་ཉན་ཐོས་ཆེན་པོ་མང་པོ་ཡང་གནས་གནས། སྔོན་ཆད་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་མང་པོ་ཡང་གནས་གནས་པ་ཡིན་ཏེ།
en: “Many supreme wise sages have continuously resided at those great stūpas in the past, as have many bodhisattva great beings, solitary buddhas, great hearers, and sages who had developed the five higher perceptions.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གང་དག་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་ཤིང་སེམས་ཅན་འཁོར་བས་སྐྲག་པ་ཡོངས་སུ་སྐྱོ་བ་རྣམས་ཀྱི་དོན་དུ་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་ཕྱིར་དབང་ཆེ་བར་གྲགས་པ། དབང་ཆེ་བར་གྲགས་པ་ཐམས་ཅད་ཀྱིས་དེ་དག་གི་ལག་ཏུ་ཡོངས་སུ་གཏད་པ་ཡིན་ནོ།
en: Those great stūpas have been blessed by all those powerful beings renowned for their great strength who were born in this buddha realm, and these places have been entrusted to them so that they may generate roots of virtue for the sake of sentient beings who are afraid and weary of saṃsāra.

source: །དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་དཔག་ཏུ་མེད་པ་ན་གང་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱུང་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་བྱ་བའི་ཕྱིར་མཆོད་རྟེན་ཆེན་པོ་ཉི་ཤུ་པོ་དེ་དག་དགོངས་ཤིང་བསམས་ལ་བྱིན་གྱིས་བརླབས་སོ།
en: In that way, all the blessed buddhas and bodhisattva great beings who have appeared in the countless buddha realms in the ten directions have considered, thought about, and blessed those twenty great stūpas in order to exhaust the karmic actions of sentient beings.

source: །དེ་བཞིན་དུ་མ་འོངས་པའི་དུས་ན་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་དཔག་ཏུ་མེད་པ་དེ་དག་ཏུ་གང་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་མཆོད་རྟེན་ཆེན་པོ་ཉི་ཤུ་པོ་དེ་དག་དགོངས་ཤིང་བསམས་པར་འགྱུར་ལ་བྱིན་གྱིས་རློབ་པར་འགྱུར་རོ།
en: Similarly, all the blessed buddhas and bodhisattva great beings who in the future will appear in the countless buddha realms in the ten directions will consider, think about, and bless those twenty great stūpas.

source: །མ་འོངས་པའི་དུས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་རྒྱལ་བའི་ཟླ་བ་གང་དག་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་སེམས་ཅན་གྱི་དོན་དུ་ལས་ཟད་པར་བྱ་བའི་ཕྱིར་མཆོད་རྟེན་ཆེན་པོ་ཉི་ཤུ་པོ་དེ་དག་ལ་གནས་པར་འགྱུར་ཞིང་བྱིན་གྱིས་རློབ་པར་འགྱུར་རོ།
en: In the future, all the most excellent victorious ones who will appear in this buddha realm will reside in and bless those twenty great stūpas for the sake of sentient beings and in order to exhaust their karmic actions.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་དང་། རང་རྒྱལ་བ་ཐམས་ཅད་དང་། ཉན་ཐོས་ཆེན་པོ་ཐམས་ཅད་དང་། དེ་བཞིན་དུ་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྣམས་ཀྱིས་ཀྱང་སེམས་ཅན་གྱི་དོན་དུ་ལས་ཟད་པར་བྱ་བའི་ཕྱིར་མཆོད་རྟེན་ཆེན་པོ་ཉི་ཤུ་པོ་དེ་དག་ལ་གནས་པར་འགྱུར་ཞིང་བྱིན་གྱིས་རློབ་པར་ཡང་འགྱུར་ཏེ།
en: All the bodhisattva great beings, solitary buddhas, great hearers, and sages who have developed the five higher perceptions will also reside in and bless those twenty great stūpas for the sake of sentient beings and to exhaust their karmic actions.

source: སེམས་ཅན་དབང་ཆེ་བར་གྲགས་པ་དེ་དག་གི་ལག་ཏུ་ཆང་ཁྱིར་ངས་ཡོངས་སུ་གཏད་པར་མཛད་དོ།
en: I will entrust their protection to those beings renowned for their great strength.

source: །དེ་བཞིན་དུ་ད་ལྟར་ཡང་མཆོད་རྟེན་ཆེན་པོའི་གནས་ཉི་ཤུ་པོ་དེ་དག་ཁྱེད་ཀྱིས་ཇི་ལྟར་མིང་ཡོངས་སུ་བཟུང་བ་བཞིན་ངས་ཡོངས་སུ་གཏད་ཀྱིས།
en: In the same way, I now entrust those twenty great stūpas to you in accordance with the names you have heard.

source: སེམས་ཅན་འཁོར་བས་ཡོངས་སུ་སྐྱོ་བ་རྣམས་ཀྱི་དོན་དུ་ཁྱེད་ཀྱིས་དེ་དག་སྲུངས་ཤིག །ཆོས་རབ་ཏུ་མི་འཇིག་པར་ཡང་དག་པར་ཟུང་ཤིག །
en: Protect those places for the sake of those sentient beings who are weary of saṃsāra! Look after them to ensure that the Dharma does not vanish!”

source: དེ་ནས་གང་དག་གི་ལག་ཏུ་མཆོད་རྟེན་ཆེན་པོའི་གནས་ཉི་ཤུ་པོ་དེ་དག་ཡོངས་སུ་གཏད་པའི་ཀླུ་དེ་དག་ཐམས་ཅད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: All the nāgas who had been entrusted to protect those twenty sacred places replied,

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀླུ་རྣམས་ནི་རྨུགས་པ་དང་གཉིད་ཀྱི་སྒྲིབ་པས་ཤིན་ཏུ་མྱོས་པ་ལགས་ཏེ།
en: “Respected Blessed One, we nāgas are severely intoxicated by the obscurations of lethargy and sleep.

source: གང་བདག་ཅག་མཚན་གཅིག་གཉིད་ལོག་པ་དེ་ནི་མིའི་ལྟར་བརྩིས་ན་དགུང་ལོ་ཉི་ཤུ་རྩ་གཅིག་འདས་པར་འགྱུར་ལགས་སོ། །
en: If we count according to human time, just one of our nights of sleep lasts for twenty-one human years.

source: གལ་ཏེ་བདག་ཅག་གཉིད་ཀྱིས་ལོག་ནས་དྲང་སྲོང་ཐུབ་པའི་གནས་དེ་དག་ཏུ་ལྷའི་ཀུན་ཏུ་འཁྲུག་པ་འགའ་ཞིག་བྱུང་བར་གྱུར་ཏམ། མིའི་ཀུན་ཏུ་འཁྲུག་པའམ། ཞུགས་སམ། ཆབ་ཀྱིས་ཀུན་ཏུ་འཁྲུག་པ་འགའ་ཞིག་བྱུང་བར་གྱུར་ན་མཆོད་རྟེན་ཆེན་པོའི་གནས་དེ་དག་རྣམ་པར་འཇིག་པར་འགྱུར་ལགས་ན་བདག་ཅག་གཉིད་ཀྱིས་ལོག་ཅིང་མྱོས་པ་དེ་དག་གིས་རབ་ཏུ་འཇིག་པ་དེ་བསལ་བར་རྔོ་མི་ཐོགས་ལགས་ཏེ།
en: If those sacred sites of wise sages were threatened by danger caused by gods, humans, fire, or water while we sleep, those great stūpas could be destroyed. Since we would be asleep and intoxicated, we would be unable to prevent their destruction.

source: དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བདག་ཅག་ནོངས་པ་བྱུང་བ་ལགས་པར་འགྱུར་ལགས་སོ།
en: This would be a great fault against all the thus-gone ones of the three times!”

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཉི་ཤུ་རྩ་བརྒྱད་པོ་དེ་དག་ལ་བཀའ་སྩལ་པ། རྟག་པར་རྒྱལ་བ་རྣམས་ཀྱིས་དགོངས་པའི་མཆོད་རྟེན་ཆེན་པོའི་གནས་དྲང་སྲོང་ཐུབ་པའི་གནས་ཁྱེད་ཀྱིས་ལོང་ཤིག །ཆང་ཁྱིར་ཡོངས་སུ་སྐྱོངས་ཤིག །ཡོངས་སུ་སྲུངས་ཤིག །
en: The Blessed One then said to twenty-eight yakṣa leaders, “Take care of those great stūpas, those sacred sites of wise sages that the victors always keep in mind. Look after them and protect them!”

source: དེའི་ཚེ་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་དྲུག་གིས་ཇི་ལྟར་རྗེས་སུ་འཐུན་པར་སྔོན་ཆད་དྲང་སྲོང་ཐུབ་པའི་གནས་སུ་ཇི་ལྟར་གནས་པར་གྱུར་པ་བཞིན་དུ་ཆང་ཁྱིར་ཡོངས་སུ་བླངས་སོ།
en: The twenty-eight great yakṣa leaders agreed to protect the sacred sites of wise sages as requested, just like those who resided there in the past.

source: །གོ་མ་སཱ་ལ་གན་དྷའི་གནས་ནི་མ་གཏོགས་ཏེ་མ་བླངས་སོ།
en: However, they did not agree to protect the sacred place of Gomasālagandha.”

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་ཁྱིམ་བདག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སའི་ནུ་མའི་གནས་རི་གླང་རུའི་དྲུང་ཆུ་བོ་གོ་མ་ཏིའི་ངོགས་གང་ན་དྲང་སྲོང་ཐུབ་པའི་གནས་གོ་མ་སཱ་ལ་གན་དྷ་ཞེས་བགྱི་བ་མཆོད་རྟེན་ཆེན་པོའི་གནས་མཆིས་པ་ནི་ཡོངས་སུ་བསྐྱང་བའི་སླད་དུ་བདག་གིས་བླངས་ལགས་ན་ས་ཕྱོགས་དེ་ན་ཡུལ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་མ་མཆིས་ལགས་སོ། །མི་རྣམས་ཀྱི་གནས་མ་མཆིས་ལགས་ཏེ།
en: At that moment, the nāga king Given by a Householder said, “Respected Blessed One, I could take up the protection of that great stūpa, the sacred site of wise sages called Gomasālagandha that is located at the place of Breast of the Earth near Mount Gośṛṇga, along the bank of the Gomatī river. However, in that region, there are no lands, villages, cities, or towns, nor are there any other places inhabited by humans.
